In [2]:
import georasters as gr 
import pandas as pd

In [7]:
slope = gr.from_file('Slope.tif')
aspect = gr.from_file('Aspect.tif')
landslide = gr.from_file('Landslide_UK.tif')

In [8]:
slopeData = slope.to_pandas()
aspectData = aspect.to_pandas()
landslideData = landslide.to_pandas()

In [4]:
slopeData.head()

   row   col       True          x        y
0    0  1787  27.940401  79.062500  31.4625
1    0  1788  28.816591  79.063333  31.4625
2    0  1789  27.351149  79.064167  31.4625
3    0  1790  23.227943  79.065000  31.4625
4    0  1791  17.590118  79.065833  31.4625

In [5]:
aspectData.head()

   row   col        True          x        y
0    0  1787  192.397369  79.062500  31.4625
1    0  1788  220.952927  79.063333  31.4625
2    0  1789  220.403107  79.064167  31.4625
3    0  1790  194.511459  79.065000  31.4625
4    0  1791  170.814560  79.065833  31.4625

In [10]:
landslideData.head()

   row  col       True          x          y
0   12    5  21.080000  77.874514  31.177661
1   12    6  21.080000  77.946548  31.177661
2   12    7  18.120001  78.018582  31.177661
3   13    7  18.120001  78.018582  31.153741
4   13    8  18.120001  78.090617  31.153741

In [11]:
landslideData.to_csv('Landslide.csv')